{"path":"blog/post/bitdefender_at_tmlss2018","templateID":2,"sharedPropsHashes":{"galleries":"ZaS0Hw"},"localProps":{"post":{"data":{"slug":"bitdefender_at_tmlss2018","authors":"Elena Burceanu","categories":"event","galleries":"tmlss2018_posters:5, tmlss2018_pictures:5","featured_img":"/galleries/tmlss2018_pictures/salina_1.jpg","date":"August-2-2018","title":"Bitdefender at TMLSS2018","id":3},"messages":[],"history":["./content/collections/posts/tmlss2018.md","content/collections/posts/tmlss2018.html"],"cwd":"/Users/eburceanu/Projects/bit-ml","contents":"<h1>Bitdefender at TMLSS2018</h1>\n<p><strong>Bitdefender's Machine Learning Unit</strong> participated with eight of its members\nat the first edition of the <a href=\"https://tmlss.ro/\">Transylvania Machine Learning Summer\nSchool</a> that took place at the end of July 2018 in\nCluj-Napoca.</p>\n<p>The organizers are well known DeepMind figures (and also Romanians :D), Doina\nPrecup, Razvan Pascanu and Viorica Patraucean and RIST institute from Cluj -\nLuigi Malago and Razvan Florian.</p>\n<p>The motivation for the Summer School was to facilitate new relations between\nthe Machine Learning research community of Eastern Europe with the rest of\nthe world by encouraging collaboration between students and researchers\nfrom Eastern Europe with other more developed research centers and also by\noffering more accessible fees to the school attendees.</p>\n<p>Since the school had excellent lecturers, the competition was tough. From over\n800 participants, only 100 were selected to participate and to present a poster\nwith his/hers research results or work in progress. The diversity of the\nparticipants was a keypoint in the selection, roughly half of the\nparticipants were Romanians.</p>\n<p>Some words about the schedule. Each day we attended to several lectures, some\nof them introductory, other more advanced. At the end of the day we had lab\nsessions on Math, Computer Vision, Language, Generative Models, Unsupervised\nLearning and Reinforcement Learning. At the poster sessions, each of us had up\nto 4h30 to present the poster to anyone interested walking by. A detailed\nprogram can be found here tmlss.ro/programme.php.</p>\n<p>Even though there were six full and exhausting days, our team really enjoyed it\nand tried to get the most out of the lecturers and from the interactions with\nthe participants and the lecturers. Bitdefender was very well represented and\nwe came back home inspired and eager to continue our research.  More, we also\ngot a Best Poster award for Computer Vision (yey!).</p>\n<p>Actually our team enjoyed this experience so much that some of them decided to\ngive an individual account of some of the highlights of TMLSS2018 and the\nlectures that gave them a long lasting impression.</p>\n<p><strong>Tudor Berariu</strong>:</p>\n<p><em>The Transylvanian Machine Learning Summer School represents the perfect venue\nfor all who are interested in pursuing a research career in machine learning.\nFor those that are yet unfamiliar with the field TMLLSS gives the chance to\ngrasp the fundamental theory of a broad set of core topics. At the same time,\nthe more experienced participants are being offered a glimpse of the top\nresearchers' reflections on the open problems in the field. All in all, Cluj\nwas the place to be this July if interested in machine learning.</em></p>\n<p><em>Amidst all those captivating lectures spanned over six days one caught my eye\nin particular: <strong>Ulrich Paquet's</strong> introduction to Variational Autoencoders.\nAlthough I held some lectures on the topic myself in the past years, I found\nUlrich's <a href=\"https://youtu.be/xTsnNcctvmU\">presentation</a> remarkable for its\nconcise, visual, extremely clear, while at the same time strongly theoretical\nelucidation of what and how VAEs do achieve. I wish my lectures were half as\ngood as his.</em></p>\n<p><em>Later that day, while visiting the boring salt mine near Turda, I also had the\nchance to chat with Ulrich and ask him a few questions regarding generative\nmodels, especially Boltzmann Machines. His exact words <em>Do not give up research\non Boltzmann Machines.</em> convinced me to recommence my efforts on training\ndifferent flavours of energy-based models to structure knowledge in\nreinforcement learning setups.</em></p>\n<p><strong>Iulia Duță</strong>:</p>\n<p><em>The main focus of the summer school was to popularize the machine learning\nfields in Eastern Europe, so the lectures' content was a mixture of\nintroductory and more advanced topics. Knowing that beforehand, I arrived in\nCluj both with the goal of capturing speaker's intuitions on fundamental\nconcepts in machine learning and insights on open, more recent challenges in\nthe field.</em></p>\n<p><em>One of the lectures that I remarked as being well structured and\ncreated exactly for this purpose was <strong>Dumitru Erhan's</strong> presentation: \"Computer\nVision: Way  Beyond  Classification\". He build the lecture incrementally, from\na classical computer vision problem (Object Detection) to a much hotter topic\n<a href=\"https://arxiv.org/abs/1612.05424\">Domain Adaptation</a>. Both of them were\npresented in terms of how the field evolved over time, highlighting advantages\nand disadvantages of each approaches. While the first part addresses a common\nproblem for computer vision researchers, Domain adaptation is a topic\nextremely important for all machine learning subfields, being a worth studying\nopen problem. So besides useful knowledge and interactions, TMLSS showed us a\nglimpse of novel research and a long bibliography to follow.</em></p>\n<p><strong>Andrei Nicolicioiu</strong>:</p>\n<p><em>The lecture that impressed me the most was the one about Graph Networks\npresented by <strong>Răzvan Pașcanu</strong>. He showed intuitions about the priors existing\nin deep networks and the need for models better suited for domains having\nstrong <a href=\"http://arxiv.org/abs/1806.01261v2\">relational priors</a>. We were\npresented in a unified way different views of the domain from general graph\nnetworks to simpler graph convolutional architectures, showing the usefulness\nof relations both in problems involving data with a more obvious graph\nstructure as molecules and in unexpected places like the interactions of\nmemories in a recurrent model. The presentation certainly inspired me to study\nmore about these approaches and how can they be applied in my research.</em></p>\n<p><strong>Dana Axinte</strong>:</p>\n<p><em>Neural networks, gradients, posters, enthusiasm, magic. These are some of the\nsettings of the first Transylvanian Machine Learning Summer School held in\nCluj, Romania. Looking through the schedule and speakers, I expected the school\nto be strong and that I would have the chance to settle new concepts while I\nwould engage with other participants with different backgrounds, but same\ninterests.</em></p>\n<p><em>I liked the balance between theoretically focused lectures and the ones that\npresented the industry usage of those concepts. Such pair of lectures that I\nparticularly appreciated were the ones by <strong>Doina Precup</strong> who took a\nprogressive approach in presenting value-based methods with function\napproximation for reinforcement learning and the one of <strong>Raia Hadsell</strong> who\nshowed how deep reinforcement learning can be applied into\n<a href=\"http://arxiv.org/abs/1610.04286v2\">robotics</a>, with the challenges that exists\nand the possible <a href=\"http://arxiv.org/abs/1804.00168v2\">solutions</a>.</em></p>\n<p><em>One of the parts of the summer school that I especially enjoyed was the panel\nsession where some lecturers shared their opinion on different interesting\ntopics. The reproducibility of experiments, the future of AI research and\nadvices to increase the local AI ecosystems, as what could be the involvement\nof governments, companies and teachers were few of the issues discussed. There\nwere no hype or buzzwords, but the lecturers were people who know today’s\nlimitations, needs and questions and get things done step by step, with an\nengineering mindset. A fundamental feeling with which I left is that it is not\nonly about learning, but sharing the experience and knowledge gained to empower\nothers to create and to strengthen the community and motivation.</em></p>\n<h3>Conclusions</h3>\n<p>It was only the first edition, but every detail was at a very high standard. In\nthe last days, we presented with Traian Rebedea the advantages of having the\nnext Summer School edition here in Bucharest. Looking forward to TMLSS2019 :)</p>\n"}}}
