[{"title":"Bitdefender at TMLSS2018","slug":"bitdefender_at_tmlss2018","authors":"Elena Burceanu","categories":"event","galleries":"tmlss2018_posters:5, tmlss2018_pictures:5","date":"August-2-2018","contents":"<p><strong>Bitdefender’s Machine Learning Unit</strong> participated with eight of its members\nat the first edition of the Transylvania Machine Learning Summer School that\ntook place at the end of July 2018 in Cluj-Napoca.</p>\n<p>The organizers are well known DeepMind figures (and also Romanians :D): Doina\nPrecup, Razvan Pascanu and Viorica Patraucean and RIST institute from Cluj\n(Luigi Malago and Razvan Florian).</p>\n<p>The motivation of the Summer School is to help the local community and to\nbetter connect the Machine Learning research environment from Eastern Europe\nwith the rest of the world, through encouraging collaborations between students\nand researchers from Eastern Europe with other more developed research centers\nand also by offering low fees and great speakers for the school attendees.</p>\n<p>Since the school had excellent lecturers, the competition was tough. From over\n800 participants, only 100 were selected to participate and to present a poster\nwith his/hers research results or work in progress. The diversity of the\nparticipants was an important keypoint in the selection, roughly half of the\nparticipants were Romanians.</p>\n<p>The setup was the following: In each day we had a several lectures (from\nintroductory to more advanced ones) and at the end of the day we had lab\nsessions (Math, Computer Vision, Language, Generative Models, Unsupervised\nLearning and Reinforcement Learning). At the poster sessions, each of us had up\nto 4h30 to present the poster to anyone interested of if from the school. A\ndetailed program can be found here tmlss.ro/programme.php.</p>\n<p>Even though there were 6 full and exhausting days, our team really enjoyed it\nand tried to get the most out of the lecturers and from the interactions with\nthe participants and the lecturers (mainly DeepMind researchers). Bitdefender\nwas very well represented (8 of us were there) and we come home inspired and\neager to continue our research. More, we also get a Best Poster award for\nComputer Vision (yey!).</p>\n<p>It was only the first edition, but every detail was at a very high standard. In\nthe last days, we presented with Traian Rebedea the advantages of having the\nnext Summer School edition here in Bucharest. Looking forward to TMLSS2019 :)</p>\n"}]