{"path":"blog/post/bitdefender_at_eeml2019","templateID":2,"sharedPropsHashes":{"galleries":"2gHC7O"},"localProps":{"post":{"data":{"slug":"bitdefender_at_eeml2019","authors":"Tudor Berariu","categories":"event","galleries":"eeml2019_pictures:6","featured_img":"/galleries/eeml2019_pictures/full_house.jpg","date":"September-20-2019","title":"Bitdefender at EEML2019","id":3},"messages":[],"history":["./content/collections/posts/eeml2019.md","content/collections/posts/eeml2019.html"],"cwd":"/Users/fgogianu/Code/web/bit-ml","contents":"<h1>Bitdefender at EEML2019</h1>\n<p>This summer Bitdefender’s Machine Learning Research Team participated in the\nsecond edition of the Eastern European Machine Learning Summer School, this\nyear’s highlight event for our fast growing machine learning community in\nRomania.</p>\n<p><img src=\"/galleries/eeml2019_pictures/group.jpg\" alt=\"eeml2019_group_photo\" title=\"EEML2019 group photo.\"></p>\n<h2>What is EEML?</h2>\n<p>The EEML Summer School gathers top researchers from universities and\ncompanies, offering an intensive week full of lectures and practicals to\nparticipants ranging from undergrad students to post-doc researchers.</p>\n<p>The summer school was successful in its mission to connect Eastern Europe\nwith the rest of the world, welcoming attendees from 42 different countries.\nBeing true to the schools values on inclusiveness, women represented almost a\nthird of the participants, more than the usual ratio encountered in STEM.</p>\n<p>Furthermore, at the national level, EEML offered the chance to meet and\nstrengthen the collaboration between research hubs in Iași, Cluj-Napoca,\nTimișoara, and Brașov.</p>\n<blockquote>\nI like the fact that, although the school grows visibly in size, you still\nhave a chance to talk and share opinions with speakers and other\nparticipants.\n<footer>\nIulia Duță, Bitdefender\n</footer>\n</blockquote>\n<p>Bringing everyone together for a full week makes EEML an ideal place to\nexchange ideas with others working on similar topics, to draw inspiration\nfrom others’ approach to their problems, and this adds a valuable extra to\nthe overall learning experience.</p>\n<blockquote>\nIt's been more than two months since I participated at EEML but the ideas\nfloated there and the relationships I started still seem highly relevant to\nme - as should be the case for any good summer school. I fondly remember the\nthings I learned from David Nagy (<a\nhref=\"https://twitter.com/dvgnagy\">@dvgnagy</a>) on Bayesian reasoning, the\ndiscussions I had with Rob (<a\nhref=\"https://twitter.com/RobertTLange\">@RobertTLange</a>) on RL, multi-agent\nsystems and much more or the reading suggestions on causal inference I got\nfrom Jeroen Berrevoets (<a\nhref=\"https://twitter.com/J_Berrevoets\">@J_Berrevoets</a>). EEML also\nfacilitated starting a research collaboration with Błażej Osiński and Maciej\nWołczyk after discussing it over some beers.\n<footer>\nFlorin Gogianu, Bitdefender\n</footer>\n</blockquote>\n<h2>Bitdefender among organizers</h2>\n<p>EEML’s mission was laid out by a group of successful romanian researchers\nthat wanted to ensure eastern european talent pool gets access to the same\nresources as the more established academic centers in the western world.\nDoina Precup, Răzvan Pașcanu, and Viorica Pătrăucean were the leading\norganizers of the summer school, and their dedication made everything\npossible.</p>\n<p>Bitdefender was one of the Gold Sponsors of EEML proving its commitment to\nadvance the local research community and invest in local education. Beside\nthat, our own Elena Burceanu was one of the organizers of EEML, putting a lot\nof time and effort into making sure that every little detail will happen like\nclockwork.</p>\n<p><img src=\"/galleries/eeml2019_pictures/bitdefender_booth.jpg\" alt=\"bitdefender_booth\" title=\"Elena and Ștefan at the Bitdefender booth.\"></p>\n<p>EEML is a huge event so it was all hands on deck. Therefore we put the\nvolunteer yellow shirts on, took a deep breath, a sip of coffee and joined\nthe efforts. Our colleagues helped participants finding their way from the\nairport to the accommodation, prepared the welcome bags, they made sure every\nvideo projector works, and that there are spare batteries for the microphones\nin the lecture room.</p>\n<p><img src=\"/galleries/eeml2019_pictures/volunteers.jpg\" alt=\"eeml_volunteers\" title=\"EEML volunteers welcoming the participants.\"></p>\n<p>The summer school kicked off with a humorous presentation about the Romanian\nculture from our own Florin Brad. That moment provided everyone with the\nenergy to go through the full week.</p>\n<!-- ![florin_brad](/galleries/eeml2019_pictures/florin_brad.jpg \"Florin Brad giving the tour.\") -->\n<p><img src=\"/galleries/eeml2019_pictures/florin_brad.jpg\" alt=\"Florin Brad\"\n title=\"Florin Brad giving the tour.\" height=520 /></p>\n<p>In Florin's own words:</p>\n<blockquote>\nThis year I held a five minute presentation about Romania during the opening\nof the summer school. They say the best way to learn something is to explain\nit to other people, so I hope people have learned one or two things about our\ncountry (because I sure have).\n<footer>\nFlorin Brad, Bitdefender\n</footer>\n</blockquote>\n<h2>The lectures</h2>\n<p>The lectures at EEML covered a broad range of topics in Machine Learning\naiming to both build the theoretical foundations for the newcomers and also\nhint to the research frontiers in the domain.</p>\n<p>Furthermore, the diverse background of the speakers enabled a wide variety of\nlectures, ranging from pragmatic descriptions of the latest research results\nto theoretical crash courses in the different areas covered by the summer\nschool.</p>\n<h2>Posters</h2>\n<p>EEML participants were encouraged to present their current work in a poster\nsession that spanned over two evenings (actually well into the night). That\nwas a great opportunity for them to get feedback from the seniors.</p>\n<blockquote>\nIt was a great opportunity to present my work at EEML, getting a chance to\nshare opinions with amazing people with varied expertise in computer vision.\nThis experience had a positive impact and helped me shape my next research\nsteps as many discussions brought a new perspective over my work.\n<footer>\nEmanuela Haller, Bitdefender\n</footer>\n</blockquote>\n<p>Our team unveiled three internal research efforts. Iulia Duță and Andrei\nNicolicioiu presented their novel recurrent space-time graph neural networks\nfor video understanding (also accepted at NeurIPS!!!). Emanuela Haller\ndiscussed her work on spacetime graph optimization for video object\nsegmentation. Florin Gogianu introduced his idea to use uncertainty to\nprioritize past experiences for training agents through reinforcement\nlearning.</p>\n<blockquote>\nEEML also provided me with the opportunity of presenting my work on\nBayesian-inspired prioritization measures for the Experience Replay buffer\nduring one of the two poster sessions. It was actually my first\nconference-like poster session I attended so it was a rather interesting\nexperience. I received some great suggestions from Diana Borsa which might\nhelp me polish this research further and also got some follow-up questions\nfrom the people I met there. Somehow I also got one of the Best Poster Awards\nand that wrapped-up nicely the great experience I had attending EEML.\n<footer>\nFlorin Gogianu, Bitdefender\n</footer>\n</blockquote>\n<h2>Teaching assistants</h2>\n<p>EEML practicals were challenging applications of the theory discussed during\nthe lectures. The subjects were quite diverse covering Image classification,\nreinforcement learning, recurrent neural nets for language models, or\ngenerative models such as variational autoencoders. The teaching assistants\nhad the job to guide the participants into solving this tasks, and leave the\nsummer school with a consistent experience in training deep neural models\nusing Tensorflow. The TAs were researchers from prestigious universities, and\ncompanies such as DeepMind, and Bitdefender.</p>\n<blockquote>\nFor me, it was quite a different perspective this time, as I join the summer\nschool as a teaching assistant, an attribution that I loved to hold as it\ngave me the opportunity, besides captivating lectures held by top researchers\nall over the world, to interact more with participants and other TAs. It was\na great mix of receptive students, awesome devoted colleagues and a strong\nteam behind all the labs that prepares everything to be fun and valuable._\n<footer>\nIulia Duță, Bitdefender\n</footer>\n</blockquote>\n<p>Our own colleagues, some of which are also teaching at University Politehnica\nof Bucharest or University of Bucharest (Iulia, Florin, Andrei, Ștefan, Ema,\nTudor) got involved in guiding the participants through the new stuff in each\nlaboratory.</p>\n<blockquote>\nI am a teaching assistant at the university, but here it was way more\nchallenging given the hard topics and the smart and enthusiastic people\nattending. Brilliant researchers were also acting as teaching assistants and\nI really appreciate interacting with them during and before the labs. It was\nvery interesting to see how other TAs explain the topics they are experts\non. \n<footer>\nAndrei Nicolicioiu, Bitdefender\n</footer>\n</blockquote>\n<h2>Epilogue</h2>\n<p>EEML was a huge opportunity for Bucharest to join and interact with the\nrelevant actors in the machine learning community. Bitdefender is proud to be\nso deeply involved in bringing this event to our city.</p>\n<blockquote>\nFacilitating new relations between like-minded researchers at the beginning\nof their careers is not the only thing making EEML great. I felt I gained a\nlot by participating or assisting in discussions with researchers like Răzvan\nPașcanu, Doina Precup, Andrei Rusu or Akata Zeynep. Simply hanging around\nthese people and hear them discussing any topic for 20 minutes can leave you\nwith tons of insights and problem formulations they've deeply thought about\nand to which you could not have access to otherwise.\n<footer>\nFlorin Gogianu, Bitdefender\n</footer>\n</blockquote>\n"}}}
